---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile.TopBendLength
source: html/7b2b2af4-1e0b-8506-4805-29bb82314e37.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile.TopBendLength Property

Top Bend segment length.

## Syntax (C#)
```csharp
public double TopBendLength { get; set; }
```